; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob8) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate6)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate3)
	(at pallet3 distributor0)
	(clear crate8)
	(at pallet4 distributor1)
	(clear crate7)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot2)
	(clear pallet6)
	(at pallet7 depot0)
	(clear crate1)
	(at pallet8 depot2)
	(clear pallet8)
	(at pallet9 distributor2)
	(clear crate5)
	(at pallet10 depot2)
	(clear pallet10)
	(at pallet11 depot0)
	(clear pallet11)
	(at truck0 depot0)
	(at truck1 distributor2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot0)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 distributor1)
	(available hoist9)
	(at hoist10 distributor0)
	(available hoist10)
	(at hoist11 depot1)
	(available hoist11)
	(at hoist12 depot0)
	(available hoist12)
	(at crate0 depot0)
	(on crate0 pallet7)
	(at crate1 depot0)
	(on crate1 crate0)
	(at crate2 distributor1)
	(on crate2 pallet4)
	(at crate3 depot2)
	(on crate3 pallet2)
	(at crate4 distributor2)
	(on crate4 pallet9)
	(at crate5 distributor2)
	(on crate5 crate4)
	(at crate6 depot0)
	(on crate6 pallet0)
	(at crate7 distributor1)
	(on crate7 crate2)
	(at crate8 distributor0)
	(on crate8 pallet3)
)

(:goal (and
		(on crate0 pallet7)
		(on crate1 pallet6)
		(on crate2 crate8)
		(on crate3 crate4)
		(on crate4 pallet0)
		(on crate5 pallet10)
		(on crate7 pallet11)
		(on crate8 pallet8)
	)
))

; plan
1. (lift hoist4 crate7 crate2 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist4) (on crate7 crate2)
   added: (lifting hoist4 crate7) (clear crate2)
   goals met: 1 of 8
2. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 1 of 8
3. (load hoist4 crate7 truck0 distributor1)
   deleted: (lifting hoist4 crate7)
   added: (in crate7 truck0) (available hoist4)
   goals met: 1 of 8
4. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 1 of 8
5. (unload hoist6 crate7 truck0 depot0)
   deleted: (in crate7 truck0) (available hoist6)
   added: (lifting hoist6 crate7)
   goals met: 1 of 8
6. (drop hoist6 crate7 pallet11 depot0)
   deleted: (lifting hoist6 crate7) (clear pallet11)
   added: (available hoist6) (at crate7 depot0) (clear crate7) (on crate7 pallet11)
   goals met: 2 of 8
7. (lift hoist9 crate2 pallet4 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist9) (on crate2 pallet4)
   added: (lifting hoist9 crate2) (clear pallet4)
   goals met: 2 of 8
8. (lift hoist7 crate5 crate4 distributor2)
   deleted: (at crate5 distributor2) (clear crate5) (available hoist7) (on crate5 crate4)
   added: (lifting hoist7 crate5) (clear crate4)
   goals met: 2 of 8
9. (load hoist7 crate5 truck1 distributor2)
   deleted: (lifting hoist7 crate5)
   added: (in crate5 truck1) (available hoist7)
   goals met: 2 of 8
10. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   goals met: 2 of 8
11. (lift hoist6 crate1 crate0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist6) (on crate1 crate0)
   added: (lifting hoist6 crate1) (clear crate0)
   goals met: 2 of 8
12. (load hoist6 crate1 truck0 depot0)
   deleted: (lifting hoist6 crate1)
   added: (in crate1 truck0) (available hoist6)
   goals met: 2 of 8
13. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 2 of 8
14. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 2 of 8
15. (load hoist9 crate2 truck1 distributor1)
   deleted: (lifting hoist9 crate2)
   added: (in crate2 truck1) (available hoist9)
   goals met: 2 of 8
16. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   goals met: 2 of 8
17. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 2 of 8
18. (unload hoist8 crate2 truck1 distributor0)
   deleted: (in crate2 truck1) (available hoist8)
   added: (lifting hoist8 crate2)
   goals met: 2 of 8
19. (lift hoist7 crate4 pallet9 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist7) (on crate4 pallet9)
   added: (lifting hoist7 crate4) (clear pallet9)
   goals met: 2 of 8
20. (drive truck1 distributor0 distributor2)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor2)
   goals met: 2 of 8
21. (load hoist7 crate4 truck1 distributor2)
   deleted: (lifting hoist7 crate4)
   added: (in crate4 truck1) (available hoist7)
   goals met: 2 of 8
22. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 2 of 8
23. (unload hoist6 crate4 truck1 depot0)
   deleted: (in crate4 truck1) (available hoist6)
   added: (lifting hoist6 crate4)
   goals met: 2 of 8
24. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 2 of 8
25. (lift hoist12 crate6 pallet0 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist12) (on crate6 pallet0)
   added: (lifting hoist12 crate6) (clear pallet0)
   goals met: 2 of 8
26. (drop hoist6 crate4 pallet0 depot0)
   deleted: (lifting hoist6 crate4) (clear pallet0)
   added: (available hoist6) (at crate4 depot0) (clear crate4) (on crate4 pallet0)
   goals met: 3 of 8
27. (unload hoist2 crate5 truck1 depot2)
   deleted: (in crate5 truck1) (available hoist2)
   added: (lifting hoist2 crate5)
   goals met: 3 of 8
28. (drop hoist2 crate5 pallet10 depot2)
   deleted: (lifting hoist2 crate5) (clear pallet10)
   added: (available hoist2) (at crate5 depot2) (clear crate5) (on crate5 pallet10)
   goals met: 4 of 8
29. (unload hoist2 crate1 truck0 depot2)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   goals met: 4 of 8
30. (drop hoist2 crate1 pallet6 depot2)
   deleted: (lifting hoist2 crate1) (clear pallet6)
   added: (available hoist2) (at crate1 depot2) (clear crate1) (on crate1 pallet6)
   goals met: 5 of 8
31. (lift hoist2 crate3 pallet2 depot2)
   deleted: (at crate3 depot2) (clear crate3) (available hoist2) (on crate3 pallet2)
   added: (lifting hoist2 crate3) (clear pallet2)
   goals met: 5 of 8
32. (load hoist2 crate3 truck1 depot2)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   goals met: 5 of 8
33. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   goals met: 5 of 8
34. (unload hoist6 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist6)
   added: (lifting hoist6 crate3)
   goals met: 5 of 8
35. (drop hoist6 crate3 crate4 depot0)
   deleted: (lifting hoist6 crate3) (clear crate4)
   added: (available hoist6) (at crate3 depot0) (clear crate3) (on crate3 crate4)
   goals met: 6 of 8
36. (lift hoist3 crate8 pallet3 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist3) (on crate8 pallet3)
   added: (lifting hoist3 crate8) (clear pallet3)
   goals met: 6 of 8
37. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 6 of 8
38. (load hoist3 crate8 truck0 distributor0)
   deleted: (lifting hoist3 crate8)
   added: (in crate8 truck0) (available hoist3)
   goals met: 6 of 8
39. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 6 of 8
40. (unload hoist2 crate8 truck0 depot2)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   goals met: 6 of 8
41. (drop hoist2 crate8 pallet8 depot2)
   deleted: (lifting hoist2 crate8) (clear pallet8)
   added: (available hoist2) (at crate8 depot2) (clear crate8) (on crate8 pallet8)
   goals met: 7 of 8
42. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 7 of 8
43. (load hoist8 crate2 truck0 distributor0)
   deleted: (lifting hoist8 crate2)
   added: (in crate2 truck0) (available hoist8)
   goals met: 7 of 8
44. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 7 of 8
45. (unload hoist2 crate2 truck0 depot2)
   deleted: (in crate2 truck0) (available hoist2)
   added: (lifting hoist2 crate2)
   goals met: 7 of 8
46. (drop hoist2 crate2 crate8 depot2)
   deleted: (lifting hoist2 crate2) (clear crate8)
   added: (available hoist2) (at crate2 depot2) (clear crate2) (on crate2 crate8)
   goals met: 8 of 8
